system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1500;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      5;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    probes_Uref
    {
        type			probes;
	functionObjectLibs	("libfieldFunctionObjects.so");
	enabled			true;

	writeControl		timeStep;
	writeInterval		1;
	objects			();	

	executeControl		timeStep;
	executeInterval		1;

	log			true;

	probeLocations		((-0.0508 0.0635 0.00635));

	fields			( U );
    }
/*
    yplus
    {
	type			yPlus;
	functionObjectLibs	("libfieldFunctionObjects.so");
	enabled			true;

	executeControl		timeStep;
	executeInterval		10;

	writeControl		timeStep;
	writeInterval		10;
	objects			();

	log			true;
    }
*/
}

// ************************************************************************* //
