system/expData/xHneg4.data
-4	1.1	0.657	0	5.16	2.7
-4	1.15	0.696	0	5.26	2.19
-4	1.2	0.719	0.001	4.67	2.23
-4	1.3	0.76	0	3.86	2.32
-4	1.4	0.79	0.001	3.49	2.1
-4	1.5	0.818	-0.001	3.06	2.05
-4	1.7	0.87	0	2.58	1.64
-4	2	0.926	0	1.8	1.18
-4	2.4	0.982	0.003	0.86	0.63
-4	2.8	1.003	0.007	0.42	0.32
-4	3.2	1.003	0.006	0.39	0.3
-4	3.6	1	0.006	0.37	0.28
-4	4	1.001	0.003	0.37	0.28
-4	5	1.001	0	0.37	0.27
-4	6	1	-0.004	0.36	0.26
-4	7.5	1.001	-0.006	0.37	0.28
-4	8.2	0.943	0.002	1.6	1.28
