system/expData/xHpos1.data
1	0.1	-0.008	-0.005	3.18	2.94
1	0.15	-0.017	-0.004	4.71	3.22
1	0.2	-0.027	-0.001	5.04	3.29
1	0.3	-0.035	0.004	5.12	3.49
1	0.4	-0.035	0.014	4.5	3.67
1	0.5	-0.035	0.022	4.94	2.9
1	0.6	-0.027	0.028	4.56	3
1	0.7	-0.005	0.025	5.03	3.44
1	0.8	0.081	0.006	9.24	7.38
1	0.9	0.292	-0.027	13.8	11.77
1	1	0.519	-0.033	13.93	10.41
1	1.1	0.704	-0.023	6.18	3.79
1	1.15	0.74	-0.022	4.87	2.84
1	1.2	0.762	-0.023	4.27	2.51
1	1.3	0.793	-0.031	3.87	2.26
1	1.4	0.827	-0.027	3.38	2.05
1	1.5	0.851	-0.031	3.08	1.98
1	1.7	0.891	-0.034	2.49	1.57
1	2	0.942	-0.033	1.76	1.21
1	2.4	0.99	-0.031	0.91	0.67
1	2.8	1.009	-0.028	0.45	0.36
1	3.2	1.003	-0.028	0.41	0.33
1	3.6	1.002	-0.026	0.4	0.33
1	4	1	-0.028	0.38	0.3
1	5	0.997	-0.027	0.36	0.29
1	6	0.994	-0.027	0.33	0.27
1	7.5	0.993	-0.025	0.36	0.3
1	8.2	0.919	-0.013	1.83	1.56
