system/expData/xHpos10.data
10	0.1	0.418	-0.029	8.89	5.63
10	0.15	0.433	-0.027	9.97	6.15
10	0.2	0.447	-0.032	10.51	6.97
10	0.3	0.471	-0.036	11.57	8.34
10	0.4	0.496	-0.041	12.24	9.08
10	0.5	0.526	-0.043	12.86	9.16
10	0.6	0.56	-0.045	13.37	9.05
10	0.7	0.596	-0.047	13.03	8.44
10	0.8	0.638	-0.047	12	7.75
10	0.9	0.676	-0.046	10.96	6.44
10	1	0.712	-0.047	9.04	5.35
10	1.1	0.745	-0.046	7.23	4.32
10	1.15	0.758	-0.045	6.44	3.92
10	1.2	0.772	-0.044	5.66	3.52
10	1.3	0.798	-0.042	4.22	2.8
10	1.4	0.819	-0.04	3.29	2.21
10	1.5	0.839	-0.039	2.54	1.8
10	1.7	0.871	-0.038	1.6	1.03
10	2	0.908	-0.034	0.96	0.66
10	2.4	0.929	-0.032	0.43	0.35
10	2.8	0.933	-0.031	0.35	0.27
10	3.2	0.937	-0.032	0.33	0.25
10	3.6	0.939	-0.03	0.32	0.24
10	4	0.94	-0.031	0.31	0.22
10	5	0.944	-0.029	0.3	0.22
10	6	0.947	-0.028	0.3	0.23
10	7.5	0.949	-0.024	0.38	0.32
10	8.2	0.827	-0.019	3.14	2.18
