system/expData/xHpos4.data
4	0.1	-0.171	-0.014	9.71	7.67
4	0.15	-0.154	-0.02	13.2	10.1
4	0.2	-0.134	-0.027	16.5	12.98
4	0.3	-0.057	-0.046	25.91	16.16
4	0.4	0.052	-0.068	32.92	18.95
4	0.5	0.169	-0.082	30.67	18.32
4	0.6	0.279	-0.093	23.24	15.9
4	0.7	0.381	-0.094	18.21	13.03
4	0.8	0.473	-0.097	17.03	10.98
4	0.9	0.568	-0.097	14.45	8.3
4	1	0.656	-0.092	11.55	6.33
4	1.1	0.73	-0.089	7.7	4.2
4	1.15	0.754	-0.087	6.27	3.52
4	1.2	0.778	-0.084	4.85	2.83
4	1.3	0.811	-0.083	3.8	2.19
4	1.4	0.835	-0.081	3.17	1.8
4	1.5	0.856	-0.079	2.86	1.52
4	1.7	0.895	-0.076	2.27	1.25
4	2	0.94	-0.072	1.47	0.78
4	2.4	0.978	-0.063	0.61	0.39
4	2.8	0.986	-0.056	0.38	0.26
4	3.2	0.984	-0.05	0.36	0.23
4	3.6	0.985	-0.047	0.36	0.23
4	4	0.985	-0.043	0.33	0.21
4	5	0.983	-0.037	0.33	0.22
4	6	0.98	-0.031	0.34	0.23
4	7.5	0.98	-0.025	0.35	0.25
4	8.2	0.892	-0.013	2.23	1.59
