system/expData/xHpos6.data
6	0.1	0.147	-0.052	17.58	12.81
6	0.15	0.169	-0.061	19.5	15.02
6	0.2	0.188	-0.067	19.53	16.5
6	0.3	0.248	-0.084	20.73	16.98
6	0.4	0.306	-0.091	19.7	16.6
6	0.5	0.369	-0.097	20.03	15.89
6	0.6	0.435	-0.099	18.36	13.86
6	0.7	0.501	-0.095	17.26	12
6	0.8	0.569	-0.094	14.96	9.63
6	0.9	0.632	-0.091	11.96	7.62
6	1	0.686	-0.089	8.88	5.57
6	1.1	0.73	-0.086	6.11	3.95
6	1.15	0.747	-0.086	5.23	3.35
6	1.2	0.763	-0.085	4.36	2.75
6	1.3	0.794	-0.083	3.4	2.19
6	1.4	0.815	-0.082	2.87	1.79
6	1.5	0.834	-0.081	2.5	1.53
6	1.7	0.869	-0.077	2.01	1.24
6	2	0.915	-0.074	1.28	0.8
6	2.4	0.949	-0.066	0.53	0.44
6	2.8	0.954	-0.06	0.42	0.33
6	3.2	0.956	-0.054	0.41	0.33
6	3.6	0.959	-0.05	0.39	0.31
6	4	0.961	-0.046	0.38	0.29
6	5	0.963	-0.04	0.38	0.3
6	6	0.965	-0.035	0.38	0.31
6	7.5	0.969	-0.027	0.42	0.34
6	8.2	0.87	-0.018	2.75	1.84
